{
  "language": "es",
  "translations": {
    "home": "Inicio",
    "backToHome": "← Volver a Todos los Generadores",
    "privacyPolicy": "Política de Privacidad",
    "termsOfService": "Términos de Servicio",
    "allRightsReserved": "Todos los derechos reservados.",
    "phoneNumberGenerator": "Generador de Números de Teléfono",
    "homeSubtitle": "Genera números de teléfono válidos para cualquier país. Perfecto para pruebas, desarrollo y protección de privacidad.",
    "usPhoneGenerator": "Generador de Números de Teléfono de EE.UU.",
    "usDescription": "Genera números de teléfono válidos de EE.UU. con códigos de área y formato apropiados. Incluye los 50 estados y sigue los estándares del Plan de Numeración de América del Norte (NANP).",
    "chinaPhoneGenerator": "Generador de Números de Teléfono de China",
    "chinaDescription": "Crea números de teléfono móviles y fijos chinos auténticos. Soporta todas las operadoras principales incluyendo China Mobile, China Unicom y China Telecom.",
    "ukPhoneGenerator": "Generador de Números de Teléfono del Reino Unido",
    "ukDescription": "Genera números de teléfono del Reino Unido incluyendo Londres, Manchester, Birmingham y otras ciudades principales. Soporta formatos móviles y de línea fija.",
    "canadaPhoneGenerator": "Generador de Números de Teléfono de Canadá",
    "canadaDescription": "Crea números de teléfono canadienses para todas las provincias y territorios. Sigue los estándares NANP con asignación apropiada de códigos de área.",
    "australiaPhoneGenerator": "Generador de Números de Teléfono de Australia",
    "australiaDescription": "Genera números de teléfono australianos incluyendo móviles, líneas fijas y números gratuitos. Cubre todos los estados y territorios.",
    "germanyPhoneGenerator": "Generador de Números de Teléfono de Alemania",
    "germanyDescription": "Crea números de teléfono alemanes con códigos de ciudad y prefijos móviles apropiados. Soporta todos los estados alemanes y ciudades principales.",
    "francePhoneGenerator": "Generador de Números de Teléfono de Francia",
    "franceDescription": "Genera números de teléfono franceses incluyendo París, Lyon, Marsella y otras regiones. Soporta formatos móviles y de línea fija.",
    "japanPhoneGenerator": "Generador de Números de Teléfono de Japón",
    "japanDescription": "Crea números de teléfono japoneses con códigos de área apropiados para Tokio, Osaka y otras prefecturas. Incluye opciones móviles y de línea fija.",
    "southKoreaPhoneGenerator": "Generador de Números de Teléfono de Corea del Sur",
    "southKoreaDescription": "Genera números de teléfono de Corea del Sur para Seúl, Busan y otras ciudades principales. Soporta formatos móviles y de línea fija.",
    "indiaPhoneGenerator": "Generador de Números de Teléfono de India",
    "indiaDescription": "Crea números de teléfono indios con códigos de estado y prefijos móviles apropiados. Cubre todos los estados y territorios de la unión.",
    "brazilPhoneGenerator": "Generador de Números de Teléfono de Brasil",
    "brazilDescription": "Genera números de teléfono brasileños incluyendo São Paulo, Río de Janeiro y otros estados. Soporta formatos móviles y de línea fija.",
    "russiaPhoneGenerator": "Generador de Números de Teléfono de Rusia",
    "russiaDescription": "Crea números de teléfono rusos para Moscú, San Petersburgo y otros sujetos federales. Incluye opciones móviles y de línea fija.",
    "generatePhoneNumbers": "Generar Números de Teléfono",
    "generateButton": "Generar Número de Teléfono",
    "generatedPhoneNumbers": "Números de Teléfono Generados",
    "numbersGenerated": "números generados",
    "numberGenerated": "número generado",
    "noNumbersYet": "Aún no se han generado números de teléfono. Haz clic en el botón de arriba para comenzar.",
    "clearAllNumbers": "Limpiar Todos los Números",
    "confirmClear": "¿Estás seguro de que quieres limpiar todos los números generados?",
    "numberFormat": "Formato de Número",
    "numberType": "Tipo de Número",
    "mobileAndLandline": "Móvil y Fijo",
    "mobileOnly": "Solo Móvil",
    "landlineOnly": "Solo Fijo",
    "randomFormat": "Formato Aleatorio",
    "stateRegion": "Estado/Región",
    "allStates": "Todos los Estados",
    "allRegions": "Todas las Regiones",
    "carrier": "Operadora",
    "allCarriers": "Todas las Operadoras",
    "copy": "Copiar",
    "copied": "¡Copiado!",
    "delete": "Eliminar",
    "phoneCopied": "¡Número de teléfono copiado al portapapeles!",
    "aboutUSNumbers": "Sobre los Números de Teléfono de EE.UU.",
    "aboutChinaNumbers": "Sobre los Números de Teléfono Chinos",
    "aboutUKNumbers": "Sobre los Números de Teléfono del Reino Unido",
    "usageNote": "Nota de Uso",
    "usageDescription": "Estos números generados son solo para propósitos de prueba y desarrollo. No deben usarse para intentos de comunicación real.",
    "selectLanguage": "Seleccionar Idioma",
    "english": "English",
    "chinese": "中文",
    "spanish": "Español",
    "hindi": "हिन्दी",
    "arabic": "العربية"
  }
}